[
    {
        "title1": "Triangles – Basic properties",
        "Itname2": "There are four rules in triangles, these valid for any type of triangle",
        "Itname3": "1) The sum of internal angles in a triangle will always sum up to 1800 i.e., x^o+y^o+z^o=180^0",
        "Itname4": "2) The sides and their corresponding angles are always proportional. The corresponding angle is always opposite to its side. The largest side is ALWAYS opposite the biggest angle and the smallest side is ALWAYS opposite the smallest angle. In the figure1 C>B>A hence z0>y0>x0 ",
        "Itname5": "3) Any side of a triangle will always be less than the sum of the other two sides but greater than the difference of the other two sides. This should be valid for all the sides",
        "Itname7": "(B – A) < C < (B + A)",
        "Itname8": "(C – A) < B < (C + A)",
        "Itname9": "(C – B) < A < (C + B)",
        "Itname10": " 4) The external angle is always equal to the sum of other twro internal angles. If we draw an external line, as in Figure 2, the angle formed will always be equal to the sum of the other two angles in the triangle.",
        "Itname11": "In this case, n = x + y. That is because x + y + z = 180^0 and n + z = 180^o. Therefore n must equal x + y. This property will be true for any triangle",
        "Ipnamme": "Perimeter and Area",
        "Itname13": "The perimeter of any figure is the distance around the outside of the figure, or the sum of the sides of that figure. The perimeter in Figure 1 is A + B + C.",
        "Itname14": "Semi perimeter is perimeter divided by 2. Denoted by     s= A+B+C/2",
        "Itname15": "The area of any figure is the amount of space that is inside that figure. To find the area of a triangle, we always need two elements: the base and the height.The base of any triangle can be any of its sides. The height of the triangle is the perpendicular distance from the base to the opposite angle. Here are some examples of triangles with different bases and heights. ",
        "Itname16": "Area=1/2 *b*h                where b=base, h=height",
        "Itname17": "or if semi perimeter is known then area is given as",
        "Itname18": "Area=/sqrt{s*(s-a)*(s-b)*(s-c)}",
        "Itname19": "where s= semi perimeter",
        "Iiimg": "<img src='http://softprep.in/images/8.4.01.png'>",
        "Iimg1": "<img src='http://softprep.in/images/8.4.02.png'>",
        "Iimg2": "<img src='http://softprep.in/images/8.4.03.png'>"   
    },
    {
        "title1": "Straight lines",
        "Itest1": "Straight Lines",
        "Iname2": "Whenever we come across the word line, we will always assume it as straight line which extends in both the directions indefinitely. A segment is part of a line which is denoted by two end points lying on that line.",
        "Iname3": "The angle around any side of a line is 180.",
        "Iname4": "Parallel lines are two lines which lie in the same plane and never intersect.",
        "Iname5": "",
        "Iname7": "",
        "Iname8": "",
        "Iname9": "",
        "Iname10": " ",
        "Iname11": "",
        "Iname13": "",
        "Iname14": "",
        "Iname15": "",
        "Iname16": "",
        "Iname17": "",
        "Iname18": "",
        "Iname19": ""
         
    },
    {
        "title1": "Angles",
        "Itest1": "Angles:",
        "Itest2": "When two lines meet an angle is formed. The point of meeting of two lines is called a vertex where the two lines are termed as sides of the angle. Angles are measured in degrees.",
        "Iname2": "Types of angles",
        "Ianame3": "Acute angle: Angle which is less than 90^{o} is called an acute angle",
        "Ianame4": "Obtuse angle: Angle which is greater than 90^{o} is called an obtuse angle",
        "Ianame5": "Right angle: Angle which is equal to 90^{o} is called a right angle",
        "Inimg": "<img src='http://softprep.in/images/8.2.01.jpg'>",
        "Ianame7": "Vertical angles: When two lines intersect the opposite angles at the intersection are equal. These angles are called vertical angles",
        "Inimg1": "<img src='http://softprep.in/images/8.2.02.png'>",
        "Ianame8": "Angles and Parallel lines:",
        "Ianame9": "Whenever a line intersects a set of parallel lines the angles at each intersection are equal, this is called transversal. Don’t assume lines are parallel just because they look like they are—the question will always tell you if two lines are meant to be parallel. Even though this figure contains many angles, it turns out that it only has two kinds of angles: big angles (obtuse) and little angles (acute). All the big angles are equal to each other, and all the little angles are equal to each other. Furthermore, any big angle + any little angle = 180°.",
        "Ianame10": "As described above, the eight angles created by these two intersections have special relationships to each other:",
        "Ianame11": "Angles 1, 4, 5, and 8 are equal to one another. Angle 1 is vertical to angle 4, and angle 5 is vertical to angle 8.",
        "Ianame12": "Angles 2, 3, 6, and 7 are equal to one another. Angle 2 is vertical to angle 3, and angle 6 is vertical to angle 7.",
        "Ianame13": "The sum of any two adjacent angles, such as 1 and 2 or 7 and 8, equals 180º because they form a straight angle lying on a line.",
        "Ianame14": "The sum of any big angle + any little angle = 180°, since the big and little angles in this figure combine into straight lines and all the big angles are equal and all the little angles are equal. So a big and little angle don’t need to be next to each other to add to 180°; any big plus any little will add to 180°. For example, since angles 1 and 2 sum to 180º, and since angles 2 and 7 are equal, the sum of angles 1 and 7 also equals 180º.",
        "Inimg2": "<img src='http://softprep.in/images/8.2.03.png'>"
      
    },
    {
        "title1": "Polygons",
        "Itest1": "Polygon Basics",
        "Iname2": "A polygon is a two-dimensional figure with three or more straight sides. Polygons are named according to the number of sides they have.",
        "Iname3": "Number of Sides",
        "Iname4": "Name",
        "Iname5": "3",
        "Iname7": "4",
        "Iname8": "5",
        "Iname9": "6",
        "Iname10": "7",
        "Iname11": "8",
        "Iname12": "9",
        "Iname13": "10",
        "Iname14": "12",
        "Iname15": "n",
        "Iname16": "triangle",
        "Iname17": "quadrilateral",
        "Iname18": "pentagon",       
        "Iname20": "hexagon",
        "Iname21": "heptagon",
        "Iname22": "octagon",
        "Iname23": "nonagon",      
        "Iname25": "decagon",
        "Iname26": "dodecagon",
        "Iname27": "n-gon",

        "Iname28": "All polygons, no matter how many sides they possess, share certain characteristics:",
        "Iname29": "The sum of the interior angles of a polygon with n sides is (n – 2)180°. For instance, the sum of the interior angles of an octagon is (8 – 2)180°= 6(180°) = 1080°.",   
        "Iname30": "A polygon with equal sides and equal interior angles is a regular polygon.",
        "Iname31": "The sum of the exterior angles of any polygon is 360°.",
        "Iname32": "The perimeter of a polygon is the sum of the lengths of its sides.",
        "Iname33": "The number of diagonals that can be drawn from a vertex in a polygon is (n-3) , where n= no. of sides in polygon.",
        "Iname34": "The total number of diagonals can be drawn in a polygon is \frac{n*(n-3)}{2}"
       
    },
    {
        "title1": "Types of Triangles",
        "Itest1": "Types of triangles:",
        "Itest2": "Based on sides",
        "Ibname2": "Equilateral triangle: An equilateral triangle has three equal sides and three equal angles. Because a triangle’s angles must add up to 180°, each angle of an equilateral triangle is always 60°. Since the sides of an equilateral triangleare always proportional, tere is a special  formula for its area. If the side of the triangle is s the formula is sqrt3*s^2/4",
        "Ibname3": "Isosceles Triangle :An isosceles triangle has two equal sides and two equal angles. In the figure to the right:/angle A=/angle C and sides AB = BC. This is in line with rule 2 above: if the two sides are equal, their opposite angles must be equal as well.The height of an isosceles triangle always bisects the triangle, creating two equal right triangles.",
        "Ibname4": "Scalene Triangle:In a scalene triangle no two sides are equal and hence no two angles are equal.",
        "Ibname5": "Based on angles:",
        "Ibname7": "Acute angle Traingle:",
        "Ibname8": "All of the angle in this triangle are less than 90^{0}.If the sides are in the order c>b>a, thenc^{2}<b^{2}+c^{2}",
        "Ibname9": "Obtuse angle triangle:",
        "Ibname10": "One of the angle is greater than 90.The side corresponding to the obtuse angle is largest side.c^{2}>b^{2}+c^{2}",
        "Ibname11": "Right angle triangle:",
        "Ibname12": "A right triangle is any triangle that contains a right angle. The side opposite the right angle is called the hypotenuse. The other two sides are called legs. The angles opposite the legs of a right triangle add up to 90°. That makes sense, because the right angle itself is 90° and every triangle contains 180° total, so the other two angles must combine for the other 90°.",
        "Ibname13": "There are also two special right triangles that we identify by the measurements of their angles. The first is the 45° – 45° – 90° triangle.",
        "Ibname14": "The 30° – 60° – 90° right triangle works in the exact same way as the 45° – 45° – 90° triangle, but with different dimensions.",
        "Ibname15": "As you can see from the diagram, the dimensions of the 30° – 60° – 90° triangle are x, /sqrt(3)x, 2x. It is imperative that you memorize this triangle and these dimensions. ",
        "Ibname16": "Similar Triangles",
        "Ibname17": "Triangles with the same angles are always proportional to each other. These triangles are called similar triangles because we can relate them to each other. In each set of similar triangles, the same sides opposite the same angles are proportional.",
        "Ibname18": "Figure 1: Two triangles, same angles. One triangle, with a parallel line cutting through its middle.This figure is composed of two triangles. They each share angle y, and their bases are parallel. For that reason, they both have angle x and angle z, and the smaller, inner triangle is proportional to the larger triangle. have the same angles.",       
        "Ibimg": "<img src='http://softprep.in/images/8.5.01.png'>",
        "Ibimg1": "<img src='http://softprep.in/images/8.5.02.png'>",
        "Ibimg2": "<img src='http://softprep.in/images/8.5.03.png'>",
        "Ibimg3": "<img src='http://softprep.in/images/8.5.04.png'>",     
        "Ibimg4": "<img src='http://softprep.in/images/8.5.05.png'>",
        "Ibimg5": "<img src='http://softprep.in/images/8.5.06.png'>",
        "Ibimg6": "<img src='http://softprep.in/images/8.5.07.png'>"       
      
    }
   
   
   
]